<!DOCTYPE html>
<html>
<head>
      <meta charset="UTF-8">
      <title>Example 4-2</title>
</head>
<body>
<?php
      $months = [1=>'มกราคม', 'กุมภาพันธ์', 'มีนาคม', 'เมษายน', 'พฤษภาคม', 'มิถุนายน', 
                         'กรกฎาคม', 'สิงหาคม', 'กันยายน', 'ตุลาคม', 'พฤศจิกายน', 'ธันวาคม'];	
      
      $today = '5/6/2020';
      echo "<p>วันเดือนปีที่กำหนด: $today</p>";
      $d = explode('/', $today);    //$d = [วันที่, เดือน, ปี]
      $m = $months[$d[1]];  
      $y = $d[2] + 543;  //แปลงเป็นปี พ.ศ.
      echo "<p>วันเดือนปีแบบไทย: วันที่ $d[0] เดือน$m ปี $y <p>";
?>
</body>
</html>
